{"version": "https://jsonfeed.org/version/1.1", "title": "CMDx", "home_page_url": "https://drexed.github.io/cmdx/", "feed_url": "https://drexed.github.io/cmdx/feed_json_created.json", "description": "Build business logic that's powerful, predictable, and maintainable.", "icon": null, "authors": [{"name": "drexed"}], "language": "en", "items": [{"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-retries-deprecation-i18n/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-retries-deprecation-i18n/", "title": "Mastering CMDx: Retries, Deprecation, and Internationalization", "content_html": "<h1>Mastering CMDx: Retries, Deprecation, and Internationalization</h1>\n<p>As developers, we often obsess over the \"happy path\"—that perfect scenario where networks never time out, requirements never change, and every user speaks English. But the real world isn't so accommodating. Services fail, code evolves, and your application needs to speak more than just one language.</p>\n<p>In this post, I want to dive into three CMDx features that help you handle these realities: <strong>Retries</strong> for resilience, <strong>Deprecation</strong> for lifecycle management, and <strong>Internationalization</strong> for global reach. These tools might seem distinct, but together they elevate your business logic from \"functional\" to \"production-grade.\"</p>", "image": null, "date_modified": "2026-02-06T18:39:29+00:00", "date_published": "2026-02-18T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-callbacks-and-middlewares/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-callbacks-and-middlewares/", "title": "Mastering CMDx Callbacks and Middlewares: Hooks and Wrappers", "content_html": "<h1>Mastering CMDx Callbacks and Middlewares: Hooks and Wrappers</h1>\n<p>When I'm writing complex business logic in Ruby, I often find that the core \"work\" is only half the battle. The other half is everything around it: logging, error handling, notifications, database transactions, and performance tracking.</p>\n<p>If you put all that code inside your main method, you end up with a mess. That's where CMDx's <strong>Callbacks</strong> and <strong>Middlewares</strong> come in. They let you separate the \"what\" from the \"how\" and the \"when,\" keeping your tasks clean and focused.</p>\n<p>Let's dive into how you can use these tools to write better service objects.</p>", "image": null, "date_modified": "2026-01-13T18:18:29+00:00", "date_published": "2026-02-11T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-attributes/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-attributes/", "title": "Mastering CMDx Attributes: Your Task's Contract with the World", "content_html": "<h1>Mastering CMDx Attributes: Your Task's Contract with the World</h1>\n<p>Attributes in CMDx are deceptively simple. You define what data your task needs, and the framework handles the rest—coercion, validation, defaults, the works. But there's real depth here. After building dozens of production systems with CMDx, I've found that well-designed attributes are the difference between tasks that \"just work\" and tasks that fight you at every turn.</p>\n<p>Let me show you what I mean.</p>", "image": null, "date_modified": "2026-01-13T18:18:29+00:00", "date_published": "2026-02-04T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-workflows/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-workflows/", "title": "Mastering CMDx Workflows: Orchestrating Complex Business Logic", "content_html": "<h1>Mastering CMDx Workflows: Orchestrating Complex Business Logic</h1>\n<p>I remember when my service objects started getting messy. I'd have a <code>PlaceOrder</code> service that began as a simple 10-line script but slowly mutated into a 500-line monster handling validation, payments, inventory, shipping, and a dozen notification types. It was a nightmare to test and even harder to read.</p>\n<p>That's exactly why I built CMDx Workflows. They allow you to decompose complex processes into small, focused tasks and orchestrate them declaratively. It turns your business logic from a tangled mess of <code>if</code> statements into a clean, readable pipeline.</p>\n<p>Let's dive into how workflows can transform your Ruby application's architecture.</p>", "image": null, "date_modified": "2026-01-13T18:18:29+00:00", "date_published": "2026-01-28T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-outcomes/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-outcomes/", "title": "Mastering CMDx Outcomes: Results, States, and Statuses", "content_html": "<h1>Mastering CMDx Outcomes: Results, States, and Statuses</h1>\n<p>If you've ever found yourself asking \"What does this service object actually return?\", you're not alone. Does it return <code>true</code>? The record it created? A hash with errors? Or does it just raise an exception and hope someone catches it?</p>\n<p>In my experience, inconsistent return values are the silent killers of maintainable Ruby code. That's why CMDx standardizes everything into a single, powerful concept: the <strong>Result</strong>.</p>", "image": null, "date_modified": "2026-01-13T18:18:29+00:00", "date_published": "2026-01-21T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-interruptions/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-interruptions/", "title": "Mastering CMDx Interruptions: Controlling Flow When Things Go Sideways", "content_html": "<h1>Mastering CMDx Interruptions: Controlling Flow When Things Go Sideways</h1>\n<p>Business logic isn't always a straight line. Orders get cancelled. Users don't have permissions. External APIs timeout. What separates robust code from fragile code is how gracefully you handle these interruptions.</p>\n<p>CMDx gives you three tools for this: halt methods (<code>skip!</code> and <code>fail!</code>), exception handling, and faults. Together, they form a complete system for controlling execution flow—whether you're stopping intentionally, handling errors, or propagating failures across tasks.</p>", "image": null, "date_modified": "2026-01-13T18:18:29+00:00", "date_published": "2026-01-14T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/mastering-cmdx-fundamentals/", "url": "https://drexed.github.io/cmdx/blog/mastering-cmdx-fundamentals/", "title": "Mastering CMDx Fundamentals: Tasks, Context, Execution, and Chains", "content_html": "<h1>Mastering CMDx Fundamentals: Tasks, Context, Execution, and Chains</h1>\n<p>When I first started building CMDx, I focused obsessively on four concepts: tasks, context, execution, and chains. These aren't just implementation details—they're the mental model that makes everything else click. Once you understand how they work together, you'll write cleaner business logic and debug issues faster.</p>\n<p>Let me walk you through each piece, building from a simple task to a fully orchestrated task.</p>", "image": null, "date_modified": "2026-01-13T18:18:29+00:00", "date_published": "2026-01-07T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}, {"id": "https://drexed.github.io/cmdx/blog/getting-started-with-cmdx/", "url": "https://drexed.github.io/cmdx/blog/getting-started-with-cmdx/", "title": "Getting Started with CMDx: Taming Business Logic in Ruby", "content_html": "<h1>Getting Started with CMDx: Taming Business Logic in Ruby</h1>\n<p>I've spent years wrestling with service objects. You know the pattern—create a class, throw some business logic in a <code>call</code> method, cross your fingers, and hope for the best. The problem? Every team member writes them differently. Every project invents its own conventions. And when something breaks at 2 AM, good luck tracing what actually happened.</p>\n<p>That frustration led me to create CMDx.</p>", "image": null, "date_modified": "2026-01-09T22:03:27+00:00", "date_published": "2026-01-01T00:00:00+00:00", "authors": [{"name": "drexed"}], "tags": ["Tutorials"]}]}